In [1]:
import warnings
warnings.filterwarnings('ignore')

## numpy

In [2]:
import numpy as np

### simulating data

In [3]:
np.random.random(size=(4,6))

array([[0.6561996 , 0.64446043, 0.4839807 , 0.42077604, 0.84888362,
        0.39677291],
       [0.92955973, 0.22024147, 0.62217606, 0.53286724, 0.02082992,
        0.606883  ],
       [0.30366026, 0.23388395, 0.62615593, 0.24856675, 0.83891245,
        0.98979871],
       [0.88064178, 0.95015669, 0.64339413, 0.85788171, 0.47486967,
        0.64891417]])

In [4]:
a=np.random.randint(3,10,size=(4,6))
a

array([[5, 5, 4, 7, 7, 5],
       [3, 7, 3, 3, 8, 4],
       [9, 5, 5, 5, 8, 7],
       [6, 5, 9, 9, 7, 8]])

In [5]:
x=np.random.choice(['a','b','c'],10)
x

array(['c', 'b', 'b', 'a', 'a', 'a', 'b', 'c', 'a', 'c'], dtype='<U1')

### numpy functions

In [6]:
np.max(a)

9

In [7]:
np.max(a,axis=0)

array([9, 7, 9, 9, 8, 8])

In [8]:
np.max(a,axis=1)

array([7, 8, 9, 9])

In [9]:
np.argmax(a,axis=0)

array([2, 1, 3, 3, 1, 3])

In [10]:
np.where(x=='a',1,2)

array([2, 2, 2, 1, 1, 1, 2, 2, 1, 2])

In [11]:
np.sqrt(a)

array([[2.23606798, 2.23606798, 2.        , 2.64575131, 2.64575131,
        2.23606798],
       [1.73205081, 2.64575131, 1.73205081, 1.73205081, 2.82842712,
        2.        ],
       [3.        , 2.23606798, 2.23606798, 2.23606798, 2.82842712,
        2.64575131],
       [2.44948974, 2.23606798, 3.        , 3.        , 2.64575131,
        2.82842712]])

## Pandas

In [12]:
import pandas as pd

### reading files from machine

In [13]:
file=r'/Users/lalitsachan/Dropbox/Trainings/DeloitteMarchPythonMLHydMarch2020/loan_data_train.csv'

In [14]:
ld=pd.read_csv(file)

### peripheral information

In [15]:
ld.head()

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
0,79542.0,25000,25000,18.49%,60 months,debt_consolidation,27.56%,VA,MORTGAGE,8606.56,720-724,11,15210,3.0,5 years
1,75473.0,19750,19750,17.27%,60 months,debt_consolidation,13.39%,NY,MORTGAGE,6737.50,710-714,14,19070,3.0,4 years
2,67265.0,2100,2100,14.33%,36 months,major_purchase,3.50%,LA,OWN,1000.00,690-694,13,893,1.0,< 1 year
3,80167.0,28000,28000,16.29%,36 months,credit_card,19.62%,NV,MORTGAGE,7083.33,710-714,12,38194,1.0,10+ years
4,17240.0,24250,17431.82,12.23%,60 months,credit_card,23.79%,OH,MORTGAGE,5833.33,730-734,6,31061,2.0,10+ years

In [16]:
ld.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 15 columns):
ID                                2199 non-null float64
Amount.Requested                  2199 non-null object
Amount.Funded.By.Investors        2199 non-null object
Interest.Rate                     2200 non-null object
Loan.Length                       2199 non-null object
Loan.Purpose                      2199 non-null object
Debt.To.Income.Ratio              2199 non-null object
State                             2199 non-null object
Home.Ownership                    2199 non-null object
Monthly.Income                    2197 non-null float64
FICO.Range                        2200 non-null object
Open.CREDIT.Lines                 2196 non-null object
Revolving.CREDIT.Balance          2197 non-null object
Inquiries.in.the.Last.6.Months    2197 non-null float64
Employment.Length                 2131 non-null object
dtypes: float64(3), object(12)
memory usage: 257.9+ KB

In [17]:
ld.shape

(2200, 15)

In [18]:
ld.dtypes

ID                                float64
Amount.Requested                   object
Amount.Funded.By.Investors         object
Interest.Rate                      object
Loan.Length                        object
Loan.Purpose                       object
Debt.To.Income.Ratio               object
State                              object
Home.Ownership                     object
Monthly.Income                    float64
FICO.Range                         object
Open.CREDIT.Lines                  object
Revolving.CREDIT.Balance           object
Inquiries.in.the.Last.6.Months    float64
Employment.Length                  object
dtype: object

In [19]:
ld.columns

Index(['ID', 'Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'FICO.Range', 'Open.CREDIT.Lines',
       'Revolving.CREDIT.Balance', 'Inquiries.in.the.Last.6.Months',
       'Employment.Length'],
      dtype='object')

### numeric summary functions

In [20]:
ld.describe()

                  ID  Monthly.Income  Inquiries.in.the.Last.6.Months
count    2199.000000     2197.000000                     2197.000000
mean    52024.256480     5727.459290                        0.898498
std     30223.972207     4073.529708                        1.219223
min        10.000000      588.500000                        0.000000
25%     26361.500000     3458.000000                        0.000000
50%     51302.000000     5000.000000                        0.000000
75%     78386.500000     6883.330000                        1.000000
max    104202.000000   102750.000000                        9.000000

In [21]:
ld.describe(include='all')

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
count,2199.000000,2199,2199,2200,2199,2199,2199,2199,2199,2197.000000,2200,2196,2197,2197.000000,2131
unique,NaN,356,658,265,3,14,1526,46,5,NaN,38,29,2080,NaN,12
top,NaN,10000,10000,12.12%,36 months,debt_consolidation,0%,CA,MORTGAGE,NaN,670-674,8,0,NaN,10+ years
freq,NaN,178,146,114,1722,1147,7,376,1018,NaN,151,226,31,NaN,575
mean,52024.256480,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5727.459290,NaN,NaN,NaN,0.898498,NaN
std,30223.972207,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4073.529708,NaN,NaN,NaN,1.219223,NaN
min,10.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,588.500000,NaN,NaN,NaN,0.000000,NaN
25%,26361.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3458.000000,NaN,NaN,NaN,0.000000,NaN
50%,51302.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5000.000000,NaN,NaN,NaN,0.000000,NaN
75%,78386.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6883.330000,NaN,NaN,NaN,1.000000,NaN
max,104202.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,102750.000000,NaN,NaN,NaN,9.000000,NaN

In [22]:
ld['Monthly.Income'].describe()

count      2197.000000
mean       5727.459290
std        4073.529708
min         588.500000
25%        3458.000000
50%        5000.000000
75%        6883.330000
max      102750.000000
Name: Monthly.Income, dtype: float64

In [23]:
ld['Home.Ownership'].describe()

count         2199
unique           5
top       MORTGAGE
freq          1018
Name: Home.Ownership, dtype: object

In [24]:
ld['Monthly.Income'].median(),ld['Monthly.Income'].mad()

(5000.0, 2396.113565297499)

### categorical summary : frequency tables , two frequecy tables , frequency proportions

In [25]:
ld['Home.Ownership'].value_counts()

MORTGAGE    1018
RENT         999
OWN          177
OTHER          4
NONE           1
Name: Home.Ownership, dtype: int64

In [26]:
ld['Home.Ownership'].value_counts(dropna=False)

MORTGAGE    1018
RENT         999
OWN          177
OTHER          4
NONE           1
NaN            1
Name: Home.Ownership, dtype: int64

In [27]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'])

Loan.Length     .  36 months  60 months
Home.Ownership
MORTGAGE        0        764        254
NONE            0          1          0
OTHER           0          3          1
OWN             0        148         29
RENT            1        805        192

In [28]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'],normalize=True)

Loan.Length            .  36 months  60 months
Home.Ownership
MORTGAGE        0.000000   0.347589   0.115560
NONE            0.000000   0.000455   0.000000
OTHER           0.000000   0.001365   0.000455
OWN             0.000000   0.067334   0.013194
RENT            0.000455   0.366242   0.087352

In [29]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'],margins=True)

Loan.Length     .  36 months  60 months   All
Home.Ownership
MORTGAGE        0        764        254  1018
NONE            0          1          0     1
OTHER           0          3          1     4
OWN             0        148         29   177
RENT            1        805        192   998
All             1       1721        476  2198

In [30]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'],normalize=True,margins=True)

Loan.Length            .  36 months  60 months       All
Home.Ownership
MORTGAGE        0.000000   0.347589   0.115560  0.463148
NONE            0.000000   0.000455   0.000000  0.000455
OTHER           0.000000   0.001365   0.000455  0.001820
OWN             0.000000   0.067334   0.013194  0.080528
RENT            0.000455   0.366242   0.087352  0.454049
All             0.000455   0.782985   0.216561  1.000000

In [31]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'],normalize='index')

Loan.Length            .  36 months  60 months
Home.Ownership
MORTGAGE        0.000000   0.750491   0.249509
NONE            0.000000   1.000000   0.000000
OTHER           0.000000   0.750000   0.250000
OWN             0.000000   0.836158   0.163842
RENT            0.001002   0.806613   0.192385

In [32]:
pd.crosstab(ld['Home.Ownership'],ld['Loan.Length'],normalize='columns')

Loan.Length       .  36 months  60 months
Home.Ownership
MORTGAGE        0.0   0.443928   0.533613
NONE            0.0   0.000581   0.000000
OTHER           0.0   0.001743   0.002101
OWN             0.0   0.085997   0.060924
RENT            1.0   0.467751   0.403361

### groupby summaries

In [33]:
ld.groupby(['Home.Ownership'])['Monthly.Income'].mean()

Home.Ownership
MORTGAGE    6659.933363
NONE                NaN
OTHER       6024.917500
OWN         4790.691864
RENT        4940.989008
Name: Monthly.Income, dtype: float64

### sorting , concatenating , merging

In [34]:
d=pd.DataFrame({
    'v1':np.random.choice(['a','b','c'],50),
    'v2':np.random.choice(['x','y','z'],50),
    'v3':np.random.randint(1,10,50)
})

In [35]:
d.sort_values(['v1','v2','v3'],ascending=[True,False,False])

   v1 v2  v3
28  a  z   7
26  a  z   6
44  a  z   6
20  a  z   5
37  a  z   5
43  a  z   5
4   a  z   4
17  a  z   3
7   a  y   8
31  a  y   8
14  a  y   7
39  a  y   7
49  a  y   6
9   a  y   5
12  a  y   5
19  a  x   7
47  a  x   6
36  a  x   5
40  a  x   5
48  a  x   5
38  b  z   6
10  b  z   4
1   b  z   1
6   b  y   9
33  b  y   9
3   b  y   8
24  b  y   8
15  b  y   7
16  b  y   7
13  b  y   4
2   b  y   3
30  b  y   2
27  b  y   1
41  b  y   1
23  b  x   9
45  b  x   7
18  b  x   5
0   c  z   6
34  c  z   6
35  c  z   5
46  c  z   3
21  c  z   2
25  c  z   1
42  c  y   9
11  c  y   5
32  c  y   4
29  c  y   3
22  c  y   2
8   c  x   6
5   c  x   2

In [36]:
d1=pd.DataFrame({'lkey':[1,2,3,4,5],'A':[20,10,0,-90,4]})
d2=pd.DataFrame({'rkey':[4,5,6,7],'B':[120,101,70,-190]})

In [37]:
pd.concat([d1,d2],axis=0,ignore_index=True)

      A      B  lkey  rkey
0  20.0    NaN   1.0   NaN
1  10.0    NaN   2.0   NaN
2   0.0    NaN   3.0   NaN
3 -90.0    NaN   4.0   NaN
4   4.0    NaN   5.0   NaN
5   NaN  120.0   NaN   4.0
6   NaN  101.0   NaN   5.0
7   NaN   70.0   NaN   6.0
8   NaN -190.0   NaN   7.0

In [38]:
pd.concat([d1,d2],axis=1)

   lkey   A  rkey      B
0     1  20   4.0  120.0
1     2  10   5.0  101.0
2     3   0   6.0   70.0
3     4 -90   7.0 -190.0
4     5   4   NaN    NaN

In [39]:
pd.merge(d1,d2,left_on='lkey',right_on='rkey',how='inner')

   lkey   A  rkey    B
0     4 -90     4  120
1     5   4     5  101

In [40]:
pd.merge(d1,d2,left_on='lkey',right_on='rkey',how='outer')

   lkey     A  rkey      B
0   1.0  20.0   NaN    NaN
1   2.0  10.0   NaN    NaN
2   3.0   0.0   NaN    NaN
3   4.0 -90.0   4.0  120.0
4   5.0   4.0   5.0  101.0
5   NaN   NaN   6.0   70.0
6   NaN   NaN   7.0 -190.0

In [41]:
pd.merge(d1,d2,left_on='lkey',right_on='rkey',how='left')

   lkey   A  rkey      B
0     1  20   NaN    NaN
1     2  10   NaN    NaN
2     3   0   NaN    NaN
3     4 -90   4.0  120.0
4     5   4   5.0  101.0

In [42]:
pd.merge(d1,d2,left_on='lkey',right_on='rkey',how='right')

   lkey     A  rkey    B
0   4.0 -90.0     4  120
1   5.0   4.0     5  101
2   NaN   NaN     6   70
3   NaN   NaN     7 -190

### subsetting rows with position or conditions

In [43]:
ld.iloc[23:27,:]

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
23,3162.0,6000,6000,11.89%,36 months,debt_consolidation,9.77%,CA,RENT,4166.67,695-699,13,15377,1.0,10+ years
24,2386.0,10000,10000,13.47%,36 months,car,5.59%,TX,RENT,4583.00,690-694,6,2432,1.0,4 years
25,57120.0,22000,22000,14.65%,60 months,debt_consolidation,29.26%,NC,MORTGAGE,3912.00,705-709,8,21633,0.0,10+ years
26,99360.0,18000,18000,24.89%,60 months,moving,14.88%,VT,RENT,4000.00,665-669,10,7377,3.0,8 years

In [44]:
ld.iloc[23:25,1:4]

   Amount.Requested Amount.Funded.By.Investors Interest.Rate
23             6000                       6000        11.89%
24            10000                      10000        13.47%

In [45]:
ld[(ld['Monthly.Income']>5000) & (ld['Home.Ownership']=='RENT')].head()

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
7,38028.0,6400,6400,7.51%,36 months,major_purchase,9.58%,IL,RENT,6400.00,735-739,11,12306,1.0,< 1 year
10,78765.0,9000,9000,10.16%,36 months,debt_consolidation,13.76%,CA,RENT,5166.67,710-714,10,6490,0.0,10+ years
22,73179.0,29175,29175,21.00%,60 months,credit_card,8.83%,MA,RENT,12500.00,695-699,9,15308,2.0,4 years
54,102234.0,8400,6725,15.45%,36 months,debt_consolidation,15.71%,MD,RENT,7083.33,640-644,7,14578,3.0,< 1 year
56,71538.0,10000,10000,12.12%,36 months,debt_consolidation,19.58%,CA,RENT,6250.00,695-699,17,16348,0.0,5 years

In [46]:
ld.loc[(ld['Monthly.Income']>5000) & (ld['Home.Ownership']=='RENT'),['Loan.Length','State']].head()

   Loan.Length State
7    36 months    IL
10   36 months    CA
22   60 months    MA
54   36 months    MD
56   36 months    CA

In [47]:
### selecting , dropping , renaming columns

In [48]:
ld['Amount.Requested'].head()

0    25000
1    19750
2     2100
3    28000
4    24250
Name: Amount.Requested, dtype: object

In [49]:
ld[['Amount.Requested','Loan.Purpose']].head()

  Amount.Requested        Loan.Purpose
0            25000  debt_consolidation
1            19750  debt_consolidation
2             2100      major_purchase
3            28000         credit_card
4            24250         credit_card

In [50]:
ld.drop(['ID','Employment.Length'],axis=1,inplace=True)

In [51]:
ld.columns

Index(['Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'FICO.Range', 'Open.CREDIT.Lines',
       'Revolving.CREDIT.Balance', 'Inquiries.in.the.Last.6.Months'],
      dtype='object')

In [52]:
del ld['Open.CREDIT.Lines']
ld.columns

Index(['Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'FICO.Range',
       'Revolving.CREDIT.Balance', 'Inquiries.in.the.Last.6.Months'],
      dtype='object')

In [53]:
ld=ld.drop(['Inquiries.in.the.Last.6.Months'],axis=1)
ld.columns

Index(['Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'FICO.Range',
       'Revolving.CREDIT.Balance'],
      dtype='object')

In [54]:
ld.rename(columns={'FICO.Range':'fico'},inplace=True)
ld.columns

Index(['Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'fico', 'Revolving.CREDIT.Balance'],
      dtype='object')

### changing data types of the columns

In [55]:
ld['Amount.Requested']=pd.to_numeric(ld['Amount.Requested'],errors='coerce')

### selecting columns by their data type

In [56]:
ld.select_dtypes(include=['object']).head()

,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,fico,Revolving.CREDIT.Balance
0,25000,18.49%,60 months,debt_consolidation,27.56%,VA,MORTGAGE,720-724,15210
1,19750,17.27%,60 months,debt_consolidation,13.39%,NY,MORTGAGE,710-714,19070
2,2100,14.33%,36 months,major_purchase,3.50%,LA,OWN,690-694,893
3,28000,16.29%,36 months,credit_card,19.62%,NV,MORTGAGE,710-714,38194
4,17431.82,12.23%,60 months,credit_card,23.79%,OH,MORTGAGE,730-734,31061

In [57]:
ld.select_dtypes(exclude=['object']).head()

   Amount.Requested  Monthly.Income
0           25000.0         8606.56
1           19750.0         6737.50
2            2100.0         1000.00
3           28000.0         7083.33
4           24250.0         5833.33

### adding columns with algebraic operations

In [58]:
ld['new_col']=ld['Amount.Requested']/ld['Monthly.Income']

In [59]:
ld.head()

,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,fico,Revolving.CREDIT.Balance,new_col
0,25000.0,25000,18.49%,60 months,debt_consolidation,27.56%,VA,MORTGAGE,8606.56,720-724,15210,2.904761
1,19750.0,19750,17.27%,60 months,debt_consolidation,13.39%,NY,MORTGAGE,6737.50,710-714,19070,2.931354
2,2100.0,2100,14.33%,36 months,major_purchase,3.50%,LA,OWN,1000.00,690-694,893,2.100000
3,28000.0,28000,16.29%,36 months,credit_card,19.62%,NV,MORTGAGE,7083.33,710-714,38194,3.952943
4,24250.0,17431.82,12.23%,60 months,credit_card,23.79%,OH,MORTGAGE,5833.33,730-734,31061,4.157145

### conditional columns

In [60]:
ld['high_loan']=(ld['new_col']>3).astype(int)

In [61]:
ld['Home.Ownership']=np.where(ld['Home.Ownership']=='OWN',ld['Home.Ownership'],'Not_Own')

In [62]:
ld.head()

,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,fico,Revolving.CREDIT.Balance,new_col,high_loan
0,25000.0,25000,18.49%,60 months,debt_consolidation,27.56%,VA,Not_Own,8606.56,720-724,15210,2.904761,0
1,19750.0,19750,17.27%,60 months,debt_consolidation,13.39%,NY,Not_Own,6737.50,710-714,19070,2.931354,0
2,2100.0,2100,14.33%,36 months,major_purchase,3.50%,LA,OWN,1000.00,690-694,893,2.100000,0
3,28000.0,28000,16.29%,36 months,credit_card,19.62%,NV,Not_Own,7083.33,710-714,38194,3.952943,1
4,24250.0,17431.82,12.23%,60 months,credit_card,23.79%,OH,Not_Own,5833.33,730-734,31061,4.157145,1

In [63]:
### string operations

In [64]:
ld['Loan.Length'].str[:2].head()

0    60
1    60
2    36
3    36
4    60
Name: Loan.Length, dtype: object

In [65]:
ld['fico'].str.split('-').head()

0    [720, 724]
1    [710, 714]
2    [690, 694]
3    [710, 714]
4    [730, 734]
Name: fico, dtype: object

In [66]:
ld['fico'].str.split('-',expand=True).head()

     0    1
0  720  724
1  710  714
2  690  694
3  710  714
4  730  734

### datetime data

In [67]:
df = pd.DataFrame(['05SEP2014',
                  '06Oct2015',
                  '19Feb2019',
                  '23Jul2018'],columns=['Mycol'])

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
Mycol    4 non-null object
dtypes: object(1)
memory usage: 112.0+ bytes

In [69]:
df['Mycol']=pd.to_datetime(df['Mycol'])

In [70]:
df

       Mycol
0 2014-09-05
1 2015-10-06
2 2019-02-19
3 2018-07-23

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
Mycol    4 non-null datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 112.0 bytes

In [72]:
df['Mycol'].dt.day

0     5
1     6
2    19
3    23
Name: Mycol, dtype: int64

In [73]:
df['Mycol'].dt.quarter

0    3
1    4
2    1
3    3
Name: Mycol, dtype: int64

### apply functions

In [75]:
ld['Loan.Purpose_char']=len(ld['Loan.Purpose'])

In [76]:
ld['Loan.Purpose_char'].head()

0    2200
1    2200
2    2200
3    2200
4    2200
Name: Loan.Purpose_char, dtype: int64

In [90]:
ld['Loan.Purpose'].fillna('missing',inplace=True)

In [91]:
ld['Loan.Purpose_char']=ld['Loan.Purpose'].apply(lambda x:len(x))

In [92]:
ld['Loan.Purpose_char'].head()

0    18
1    18
2    14
3    11
4    11
Name: Loan.Purpose_char, dtype: int64

### replacing values

In [93]:
## creating flag variables

In [ ]:
## creating features from text data

In [ ]:
## sampling data

In [ ]:
### creating summary features